print(type("안녕하세요"))
print(type(316))
print()

print("안녕하세요")
print("안녕하세요")
print('"안녕하세요"라고 말했습니다')
print()

print('"안녕하세요"라고 말했습니다.')
print("'안녕하세요'라고 말했습니다.")
print()

print("안녕하세요\n안녕하세요")
print("안녕하세요\t안녕하세요")
print("\\\\\\")
print()

print("동해물과 백두산이 마르고 닳도록\n하느님이 보우하사 우리나라 만세\n무궁화 삼천리 화려강산 대한사람\n대한으로 길이 보전하세")
print()
print(
    """\
동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세
무궁화 삼천리 화려강산 대한사람
대한으로 길이 보전하세\
"""
)

print("안녕" + "하세요")
print("안녕" + "123")
print(3 * "안녕하슈")
print()

print("안녕하새우산더미"[6])
print('"더" 가나오지?')
print("안녕하새우산더미"[-2])
print("안녕하새우산더미"[1:6])
print("안녕하새우산더미"[:6])
print()

print("일이삼사오육칠팔구십"[9])
print("일이삼사오육칠팔구십"[0:9])
print("일이삼사오육칠팔구십"[:9])
print("일이삼사오육칠팔구십"[0:])
# print("일이삼사오육칠팔구십"[119])
print(len("일이삼사오육칠팔구십"[9]))
print(len("일이삼사오육칠팔구십"))
print()

print("5 + 7 =", 5 + 7)
print("3/2=", 3 / 2)
print("3//2=", 3 // 2)
